Terraform module:
```
module "gke-cluster-standard" {
  source = "git::git@github.com:GoogleCloudPlatform/cloud-foundation-fabric.git//modules/gke-cluster-standard?ref=daily-2024.02.04"

  deletion_protection = var.deletion_protection

  project_id      = var.project_id
  name            = var.cluster_name
  description     = var.description
  location        = var.region
  release_channel = "REGULAR"

  vpc_config = {
    network    = local.vpc_name
    subnetwork = local.subnetwork_name
    secondary_range_names = {
      pods     = var.secondary_range_names_pods
      services = var.secondary_range_names_services
    }
    master_ipv4_cidr_block   = var.master_ipv4_cidr_block
    master_authorized_ranges = local.authorized_ranges
  }

  private_cluster_config = {
    enable_private_endpoint = var.private_endpoint
    master_global_access    = true
  }

  # List of all available addons:
  # https://github.com/GoogleCloudPlatform/cloud-foundation-fabric/blob/211b8a0b7cb2710a5eaa032679cce480778bb186/modules/gke-cluster-standard/variables.tf#L72
  enable_addons = {
    gce_persistent_disk_csi_driver = true
    gcs_fuse_csi_driver            = true
    horizontal_pod_autoscaling     = true
    http_load_balancing            = true
  }

  # List of all available features:
  # https://github.com/GoogleCloudPlatform/cloud-foundation-fabric/blob/211b8a0b7cb2710a5eaa032679cce480778bb186/modules/gke-cluster-standard/variables.tf#L96
  enable_features = {
    binary_authorization = false
    cost_management      = true
    dns = {
      provider = "CLOUD_DNS"
      scope    = "CLUSTER_SCOPE"
    }
    dataplane_v2         = true
    fqdn_network_policy  = true
    gateway_api          = true
    image_streaming      = true
    intranode_visibility = false
    l4_ilb_subsetting    = false
    shielded_nodes       = true
    workload_identity    = true
  }

  node_config = {
    boot_disk_kms_key = local.kms_key
    service_account   = local.service_account
  }

  cluster_autoscaling = {
    auto_provisioning_defaults = {
      boot_disk_kms_key = local.kms_key
      disk_size         = 150
      service_account   = local.service_account
      oauth_scopes = [
        "https://www.googleapis.com/auth/devstorage.read_only",
        "https://www.googleapis.com/auth/logging.write",
        "https://www.googleapis.com/auth/monitoring",
        "https://www.googleapis.com/auth/monitoring.write",
        "https://www.googleapis.com/auth/userinfo.email"
      ]
      shielded_instance_config = {
        secure_boot = true
      }
      upgrade_settings = {
        surge = {
          max         = 0
          unavailable = 1
        }
      }
    }
    cpu_limits = {
      min = 0
      max = 10000
    }
    mem_limits = {
      min = 0
      max = 10000
    }
    autoscaling_profile = "OPTIMIZE_UTILIZATION"
  }

  logging_config = {
    enable_system_logs             = true
    enable_workloads_logs          = true
    enable_api_server_logs         = true
    enable_scheduler_logs          = true
    enable_controller_manager_logs = true
  }

  maintenance_config = var.maintenance_config

  monitoring_config = {
    enable_system_metrics = true

    # Control plane metrics
    enable_api_server_metrics         = false
    enable_controller_manager_metrics = false
    enable_scheduler_metrics          = false

    # Kube state metrics
    enable_daemonset_metrics   = false
    enable_deployment_metrics  = false
    enable_hpa_metrics         = false
    enable_pod_metrics         = false
    enable_statefulset_metrics = false
    enable_storage_metrics     = false

    # Google Cloud Managed Service for Prometheus
    enable_managed_prometheus = false
  }

  labels = {
    bm_security_zone  = var.bm_security_zone
    env               = var.env
    continent         = var.continent
    csp               = "gcp"
    infra_product     = var.infra_product
    marketplace       = var.region
    bm_cluster_name   = var.cluster_name
    kubernetescluster = var.cluster_name
    region            = var.region
  }

  backup_configs = {
    enable_backup_agent = var.enable_gke_backup
    backup_plans = {
      "backup-${var.cluster_name}" = {
        encryption_key        = local.kms_key
        region                = var.region
        retention_policy_days = var.backup_retention_policy_days
        schedule              = local.cron_schedule[var.continent]
      }
    }
  }

  depends_on = [
    google_project_iam_member.cluster_service_account-nodeService_account,
    google_project_iam_member.cluster_service_account-gcr,
    google_project_iam_member.cluster_service_account-artifact-registry,
    google_project_iam_member.cluster_service_account-network-user,
    google_project_iam_member.cluster_service_account-host-service-agent-user,
    google_project_iam_member.cluster_service_account-compute-security-admin,
  ]
}
```

Terragrunt file:
```
include {
  path = find_in_parent_folders("env.hcl")
}

terraform {
  source = "/home/test/git/repo//gcp-kubernetes-engine"
}

inputs = {
  project_id = "gke-sandbox-tttt"

  cluster_name     = "gke-sandbox-eu-1"
  region           = "europe-west1"
  bm_security_zone = "sandbox"
  continent        = "eu"
  env              = "sandbox"
  infra_product    = "sandbox"
  use_default_kms  = false

  vpc_name                       = "bm-default"
  subnetwork_name                = "bm-default"
  master_ipv4_cidr_block         = "xx.xx.x.x/xx"
  secondary_range_names_pods     = ""
  secondary_range_names_services = ""
  private_endpoint               = false

  deletion_protection = false

  registry_project_ids = ["gke-sandbox-tttt"]
}
```

Plan:
```
> terragrunt plan -target 'module.gke-cluster-standard.google_container_cluster.cluster'

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::ssh://git@github.com/GoogleCloudPlatform/cloud-foundation-fabric.git?ref=daily-2024.02.04 for gke-cluster-standard...
- gke-cluster-standard in .terraform/modules/gke-cluster-standard/modules/gke-cluster-standard
Downloading git::ssh://git@github.com/GoogleCloudPlatform/cloud-foundation-fabric.git?ref=daily-2024.02.04 for gke-nodepool...
- gke-nodepool in .terraform/modules/gke-nodepool/modules/gke-nodepool

Initializing provider plugins...
- Finding hashicorp/google-beta versions matching ">= 5.4.0, >= 5.11.0, < 6.0.0"...
- Finding cloudflare/cloudflare versions matching ">= 4.19.0, < 5.0.0"...
- Finding hashicorp/google versions matching ">= 5.4.0, >= 5.11.0, < 6.0.0"...
- Finding latest version of hashicorp/random...
- Installing cloudflare/cloudflare v4.23.0...
- Installed cloudflare/cloudflare v4.23.0 (self-signed, key ID C76001609EE3B136)
- Installing hashicorp/google v5.14.0...
- Installed hashicorp/google v5.14.0 (signed by HashiCorp)
- Installing hashicorp/random v3.6.0...
- Installed hashicorp/random v3.6.0 (signed by HashiCorp)
- Installing hashicorp/google-beta v5.14.0...
- Installed hashicorp/google-beta v5.14.0 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.cluster_service_account-nodeService_account will be created
  + resource "google_project_iam_member" "cluster_service_account-nodeService_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gke-sandbox-ttttt"
      + role    = "roles/container.nodeServiceAccount"
    }

  # google_service_account.cluster_service_account will be created
  + resource "google_service_account" "cluster_service_account" {
      + account_id   = (known after apply)
      + disabled     = false
      + display_name = "Terraform-managed service account for cluster gke-sandbox-eu-1"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "gke-sandbox-tttt"
      + unique_id    = (known after apply)
    }

  # random_string.cluster_service_account_suffix will be created
  + resource "random_string" "cluster_service_account_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.gke-cluster-standard.google_container_cluster.cluster will be created
  + resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = "ADVANCED_DATAPATH"
      + default_max_pods_per_node   = 110
      + deletion_protection         = false
      + enable_fqdn_network_policy  = true
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_multi_networking     = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "gke-sandbox-eu-1"
      + network                     = "bm-default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "gke-sandbox-tttt"
      + remove_default_node_pool    = true
      + resource_labels             = {
          + "bm_cluster_name"   = "gke-sandbox-eu-1"
          + "bm_security_zone"  = "sandbox"
          + "continent"         = "eu"
          + "csp"               = "gcp"
          + "env"               = "sandbox"
          + "infra_product"     = "sandbox"
          + "kubernetescluster" = "gke-sandbox-eu-1"
          + "marketplace"       = "europe-west1"
          + "region"            = "europe-west1"
        }
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "bm-default"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = true
            }
          + config_connector_config {
              + enabled = false
            }
          + dns_cache_config {
              + enabled = false
            }
          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }
          + gcp_filestore_csi_driver_config {
              + enabled = false
            }
          + gcs_fuse_csi_driver_config {
              + enabled = true
            }
          + gke_backup_agent_config {
              + enabled = true
            }
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
          + istio_config {
              + disabled = true
            }
          + kalm_config {
              + enabled = false
            }
          + network_policy_config {
              + disabled = true
            }
        }

      + cluster_autoscaling {
          + autoscaling_profile = "OPTIMIZE_UTILIZATION"
          + enabled             = true

          + resource_limits {
              + maximum       = 10000
              + minimum       = 0
              + resource_type = "cpu"
            }
          + resource_limits {
              + maximum       = 10000
              + minimum       = 0
              + resource_type = "memory"
            }
        }

      + cost_management_config {
          + enabled = true
        }

      + dns_config {
          + cluster_dns       = "CLOUD_DNS"
          + cluster_dns_scope = "CLUSTER_SCOPE"
        }

      + gateway_api_config {
          + channel = "CHANNEL_STANDARD"
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
          + stack_type                    = "IPV4"
        }

      + logging_config {
          + enable_components = [
              + "APISERVER",
              + "CONTROLLER_MANAGER",
              + "SCHEDULER",
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "02:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
            ]

          + managed_prometheus {
              + enabled = false
            }
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }
        }

      + node_pool_defaults {
          + node_config_defaults {
              + logging_variant = (known after apply)

              + gcfs_config {
                  + enabled = true
                }
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "xxx.xx.x.x/xx"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config {
              + enabled = true
            }
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + workload_identity_config {
          + workload_pool = "gke-sandbox-ttttt.svc.id.goog"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```